html/portfolio/portfolio.html
<!DOCTYPE html>
<html>
<head>
<!-- 2021-05-29 Sat 22:28 -->
<meta charset="utf-8">
<title>Portfolio of Projects</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Quan Vu">
<meta name="twitter:site" content="@null" />
<meta name="twitter:creator" content="@null" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="icon" type="image/png" href="https://vhquan.github.io/.images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="https://vhquan.github.io/.images/icon/apple-touch-icon.png" />
<link rel="stylesheet" type="text/css" href="https://vhquan.github.io/.css/font.css">
<link rel="stylesheet" type="text/css" href="https://vhquan.github.io/.css/main.css">
</head>
<body>
<div id="wrapper">
<div id="preamble" class="status">
<h1 class="title"><a href="https://vhquan.github.io">I have no idea what to write !!!</a></h1>

<nav>
  <div class="navitem"><a href="https://vhquan.github.io">About</a></div>
  <!-- <div class="navitem"><a href="https://vhquan.github.io/html/posts/index.html">Blog</a></div> -->
  <div class="navitem"><A href="https://vhquan.github.io/archive/">Blog</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/portfolio/portfolio.html">Portfolio</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/contact/contact.html">Contact</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/resume/resume.html">R&eacute;sum&eacute;</a></div>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Portfolio of Projects</h1>
</header>
<div id="outline-container-org0d24b9d" class="outline-2">
<h2 id="org0d24b9d">Academic Projects</h2>
<div class="outline-text-2" id="text-org0d24b9d">
<ul class="org-ul">
<li><b>License Plate Recognition</b>: Developing a program that process an image contains licence plate number, using OpenCV library to processing image and detect license number.</li>
<li><b>Wall-following control of a mobile robot using the fuzzy controller</b>: Create a mobile robot follow wall using a fuzzy logic controller (FLC), based on sensorial information given by two ultrasonic sensor.</li>
<li><b>Object tracking for mobile robot</b>: This project proposed the real-time (nearly) tracking algorithm in the active camera system, which based on the intelligent method (in this using fuzzy logic controller). To seperate object from background, the similarity of the color is analyzed through the HSV space and image filter (create a mask based on color value was selected by user then multiple it with origin image). After segmentation, the coordinate of object in frame will be sent to the fuzzy controller where it is used to track the moving object. This experiment is performed using the developed embedded system with an ARM chip, IP camera, LoRA.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer">
<p>Proudly with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>.</div>
</div>
</div>
</body>
</html>
